Repository: rgomez31UAQ/EvilCrowRF-V2_CC1101-Gadget
Catalog: mobile_app/lib/l10n/app_*.arb
Languages: ru

source: Start Analyzer
ru: Запустить анализатор

# jammerDisclaimer
source: For educational use only. Jamming may be illegal in your jurisdiction.
ru: Только для образовательных целей. Глушение может быть незаконным.

source: Mode
ru: Режим

source: Full Spectrum
ru: Полный спектр

# fullSpectrumDesc
source: 1-124 channels
ru: 1-124 канала

# wifiModeDesc
source: 2.4 GHz WiFi channels
ru: Каналы WiFi 2.4 ГГц

# bleModeDesc
source: BLE data channels
ru: Каналы данных BLE

source: BLE Advertising
ru: BLE реклама

# bleAdvertisingDesc
source: BLE advert channels
ru: Рекламные каналы BLE

# bluetoothDesc
source: Classic BT channels
ru: Классические каналы BT

source: USB Wireless
ru: USB беспроводной

# usbWirelessDesc
source: USB wireless channels
ru: Каналы USB беспроводных

source: Video Streaming
ru: Видеопоток

# videoStreamingDesc
source: Video channels
ru: Видео каналы

source: RC Controllers
ru: RC контроллеры

# rcControllersDesc
source: RC channels
ru: Каналы RC

source: Single Channel
ru: Один канал

# singleChannelDesc
source: One specific channel
ru: Один конкретный канал

source: Custom Hopper
ru: Свой хоппер

# customHopperDesc
source: Custom range + step
ru: Диапазон + шаг

source: Channel
ru: Канал

# channelFreq
source: Channel: {ch} ({freq} MHz)
ru: Канал: {ch} ({freq} МГц)

source: Hopper Config
ru: Настройки хоппера

# stopLabel
source: Stop
ru: Стоп

source: Step
ru: Шаг

source: Start Jammer
ru: Запустить глушилку

source: Stop Jammer
ru: Остановить глушилку

source: Device Info
ru: Информация

source: Current Firmware
ru: Текущая прошивка

# freeHeapBytes
source: {bytes} bytes
ru: {bytes} байт

source: Connection
ru: Подключение

source: Firmware Update
ru: Обновление прошивки

source: Latest Version
ru: Последняя версия

source: Update Available
ru: Доступно обновление

# upToDate
source: No (up to date)
ru: Нет (актуальная)

source: Yes
ru: Да

source: Check for Updates
ru: Проверить обновления

source: Checking...
ru: Проверка...

source: Download
ru: Скачать

# downloading
source: Downloading firmware...
ru: Загрузка прошивки...

# downloadComplete
source: Download complete ({bytes} bytes)
ru: Загрузка завершена ({bytes} байт)

# noNewVersion
source: No new version available.
ru: Новых версий нет.

source: API Error
ru: Ошибка API

source: OTA Transfer
ru: OTA передача

# sendingChunk
source: Sending chunk {current}/{total}
ru: Отправка блока {current}/{total}

# firmwareUploadedSuccess
source: Firmware uploaded successfully!
ru: Прошивка загружена успешно!

# deviceWillVerify
source: Device will verify and install the update.
ru: Устройство проверит и установит обновление.

# firmwareReady
source: Firmware ready: {bytes} bytes
ru: Прошивка готова: {bytes} байт

source: Start OTA Update
ru: Начать OTA обновление

# otaTransferComplete
source: OTA transfer complete! Device will reboot.
ru: OTA передача завершена! Устройство перезагрузится.

# transferFailed
source: Transfer failed: {error}
ru: Ошибка передачи: {error}

# md5Mismatch
source: MD5 mismatch! File may be corrupted.
ru: Несовпадение MD5! Файл повреждён.

source: Debug mode disabled
ru: Режим отладки отключён

source: Debug mode enabled
ru: Режим отладки включён

source: Debug
ru: Отладка

source: Disable DBG
ru: Отключить DBG

source: Settings synced with device
ru: Настройки синхронизированы с устройством

source: App Settings
ru: Настройки приложения

# appSettingsSubtitle
source: Language, cache, permissions
ru: Язык, кэш, разрешения

source: RF Settings
ru: Настройки RF

# rfSettingsSubtitle
source: Bruteforce, Radio & Scanner settings
ru: Брутфорс, радио и сканер

source: Synced with device
ru: Синхронизировано с устройством

source: Local only
ru: Только локально

source: Bruteforce Settings
ru: Настройки брутфорса

source: Radio Settings
ru: Настройки радио

source: Scanner Settings
ru: Настройки сканера

# interFrameDelay
source: Inter-frame Delay: {ms} ms
ru: Задержка: {ms} мс

# delayBetweenTransmissions
source: Delay between each RF transmission
ru: Задержка между передачами RF

# repeatsCount
source: Repeats: {count}x
ru: Повторы: {count}x

# transmissionsPerCode
source: Transmissions per code (1-10)
ru: Передач на код (1-10)

# txPowerLevel
source: TX Power: Level {level}
ru: Мощность TX: Уровень {level}

# bruterTxPowerDesc
source: Bruter transmission power (0=Min, 7=Max)
ru: Мощность передачи брутера (0=Мин, 7=Макс)

# txPowerInfoDesc
source: TX power in dBm. Higher = longer range but more interference. Default: +10 dBm.
ru: Мощность TX в дБм. Больше = дальше, но больше помех. По умолчанию: +10 дБм.

# rssiThreshold
source: RSSI Threshold: {dbm} dBm
ru: Порог RSSI: {dbm} дБм

# minSignalStrengthDesc
source: Minimum signal strength to detect (-120 to -20)
ru: Минимальная сила сигнала для обнаружения (от -120 до -20)

source: nRF24 Settings
ru: Настройки nRF24

# nrf24SettingsSubtitle
source: PA level, data rate, channel
ru: PA уровень, скорость, канал

# nrf24ConfigDesc
source: Configure the nRF24L01 radio module for MouseJack attacks, spectrum analysis, and jamming.
ru: Конфигурация модуля nRF24L01 для атак MouseJack, анализа спектра и глушения.

# paLevel
source: PA Level: {level}
ru: Уровень PA: {level}

# transmissionPowerDesc
source: Transmission power (MIN → MAX)
ru: Мощность передачи (MIN → MAX)

# nrfDataRate
source: Data Rate: {rate}
ru: Скорость: {rate}

# radioDataRateDesc
source: Radio data rate — lower = longer range
ru: Скорость данных — ниже = дальше

# defaultChannel
source: Default Channel: {ch}
ru: Канал по умолчанию: {ch}

# autoRetransmit
source: Auto-Retransmit: {count}x
ru: Авто-повтор: {count}x

# retransmitCountDesc
source: Retransmit count on failure (0-15)
ru: Количество повторных передач при ошибке (0-15)

source: Send to Device
ru: Отправить на устройство

source: Connect to device to apply
ru: Подключитесь к устройству для применения

# nrf24SettingsSent
source: nRF24 settings sent to device
ru: Настройки nRF24 отправлены

# failedToSendNrf24Settings
source: Failed to send nRF24 settings: {error}
ru: Не удалось отправить настройки nRF24: {error}

source: HW Buttons
ru: Кнопки

# configureHwButtonActions
source: Configure hardware button actions
ru: Настроить действия кнопок

# hwButtonsDesc
source: Assign an action to each physical button on the device. Press "Send to Device" to apply.
ru: Назначьте действие каждой кнопке устройства. Нажмите «Отправить» для применения.

source: Button 1 (GPIO34)
ru: Кнопка 1 (GPIO34)

source: Button 2 (GPIO35)
ru: Кнопка 2 (GPIO35)

# buttonConfigSent
source: Button config sent to device
ru: Конфигурация кнопок отправлена

# failedToSendConfig
source: Failed to send config: {error}
ru: Не удалось отправить конфигурацию: {error}

source: Firmware Info
ru: Информация о прошивке

# versionLabel
source: Version: v{version}
ru: Версия: v{version}

# fwVersionDetails
source: Major: {major} | Minor: {minor} | Patch: {patch}
ru: Мажорная: {major} | Минорная: {minor} | Патч: {patch}

# waitingForDeviceResponse
source: Waiting for device response... Please try again in a moment.
ru: Ожидание ответа устройства... Попробуйте снова через мгновение.

# tapOtaUpdateDesc
source: Tap "OTA Update" below to check for updates and flash new firmware.
ru: Нажмите «OTA обновление» для проверки обновлений и прошивки.

# deviceFwVersion
source: Device FW: v{version}
ru: Прошивка: v{version}

# updateFirmwareDesc
source: Update firmware via BLE OTA or check for new releases on GitHub.
ru: Обновление прошивки через BLE OTA или проверка новых версий на GitHub.

source: Check FW Version
ru: Проверить версию

source: OTA Update
ru: OTA обновление

source: Connect to a device first
ru: Сначала подключите устройство

source: Checking for app updates...
ru: Проверка обновлений приложения...

# appUpToDate
source: App is up to date (v{version})
ru: Приложение обновлено (v{version})

source: App Update Available
ru: Доступно обновление

# currentVersionLabel
source: Current: v{version}
ru: Текущая: v{version}

# latestVersionLabel
source: Latest: v{version}
ru: Новая: v{version}

# changelogLabel
source: Changelog:
ru: Список изменений:

source: Later
ru: Позже

# downloadAndInstall
source: Download & Install
ru: Скачать и установить

# updateCheckFailed
source: Update check failed: {error}
ru: Ошибка проверки обновления: {error}

source: Downloading APK...
ru: Загрузка APK...

# apkSavedPleaseInstall
source: APK saved to: {path} Please install manually.
ru: APK сохранён: {path} Установите вручную.

source: Check App Update
ru: Проверить обновление

source: About
ru: О программе

# appTagline
source: Sub-GHz RF Security Tool
ru: Инструмент RF-безопасности Sub-GHz

source: Connection Status
ru: Состояние подключения

source: Debug Controls
ru: Управление отладкой

source: CPU Temp Offset
ru: Смещение температуры CPU

# cpuTempOffsetDesc
source: Adds an offset to the ESP32 internal temperature sensor (stored on device).
ru: Добавляет смещение к внутреннему датчику температуры ESP32 (сохраняется на устройстве).

source: Clear Cached Device
ru: Очистить кэш устройства

source: Refresh Files
ru: Обновить файлы

source: Activity Logs
ru: Журнал активности

source: Hide Unknown
ru: Скрыть неизвестные

source: SD Card
ru: SD-карта

source: Internal
ru: Внутренняя

source: Internal (LittleFS)
ru: Внутренняя (LittleFS)

source: Directory
ru: Каталог

source: Flash Local Binary
ru: Прошить локальный файл

# selectBinFileDesc
source: Select a .bin firmware file from your device to flash directly via BLE OTA.
ru: Выберите файл .bin прошивки для прямой загрузки через BLE OTA.

source: Select .bin
ru: Выбрать .bin

source: Flash
ru: Прошить

# fileLabel
source: File: {path}
ru: Файл: {path}

source: Local firmware uploaded!
ru: Локальная прошивка загружена!

# changelogVersion
source: Changelog — v{version}
ru: Изменения — v{version}

source: Starting OTA transfer...
ru: Начало OTA передачи...

# frequencyRequired
source: Frequency is required
ru: Частота обязательна

source: Invalid frequency format
ru: Неверный формат частоты

# frequencyRangeError
source: Frequency must be in range 300-348, 387-464, or 779-928 MHz
ru: Частота должна быть в диапазоне 300-348, 387-464 или 779-928 МГц

source: Select Frequency
ru: Выберите частоту

source: Invalid data rate format
ru: Неверный формат скорости

# dataRateRangeError
source: Data rate must be between {min} and {max} kBaud
ru: Скорость должна быть от {min} до {max} кБод

source: Invalid deviation format
ru: Неверный формат девиации

# deviationRangeError
source: Deviation must be between {min} and {max} kHz
ru: Девиация должна быть от {min} до {max} кГц

source: Errors
ru: Ошибки

source: No signal data to preview
ru: Нет данных для предпросмотра

source: Signal Preview
ru: Предпросмотр сигнала

source: Data Length
ru: Длина данных

source: Sample Data:
ru: Пример данных:

source: Load Signal File
ru: Загрузить файл сигнала

source: Select File
ru: Выбрать файл

source: Formats
ru: Форматы

# supportedFormatsShort
source: Supported formats: .sub (FlipperZero), .json (TUT)
ru: Поддерживаемые форматы: .sub (FlipperZero), .json (TUT)

source: Supported File Formats
ru: Поддерживаемые форматы файлов

source: Ready to Transmit
ru: Готово к передаче

# percentComplete
source: {progress}% complete
ru: {progress}% завершено

source: Validation Errors
ru: Ошибки валидации

source: No transmission history
ru: Нет истории передач

source: Transmission History
ru: История передач

source: Success
ru: Успешно

source: Go Up
ru: Наверх

source: Connect to device to see files
ru: Подключите устройство для просмотра файлов

source: No files available for selection
ru: Нет файлов для выбора

source: Deselect file
ru: Отменить выбор

# selectFileTooltip
source: Select file
ru: Выбрать файл

source: Save to Signals
ru: Сохранить в сигналы

source: Full Path
ru: Полный путь

source: Downloading files...
ru: Загрузка файлов...

source: Close
ru: Закрыть

source: Root
ru: Корень

source: No subdirectories
ru: Нет подкаталогов

# storageLabel
source: Storage:
ru: Хранилище:

source: Error loading directories
ru: Ошибка загрузки каталогов

source: Select
ru: Выбрать

source: Settings not available
ru: Настройки недоступны

# playingFile
source: Playing file: {filename}
ru: Воспроизведение файла: {filename}

# failedToSaveSignal
source: Failed to save signal: {error}
ru: Не удалось сохранить сигнал: {error}

# failedToDeleteFile
source: Failed to delete file: {error}
ru: Не удалось удалить файл: {error}

# deletingFile
source: Deleting file: {name}
ru: Удаление файла: {name}

# recordScreenHelpContent
source: This screen allows you to record RF signals using the CC1101 modules. • Select a module tab to configure its settings • Tap Start Recording to begin capturing • Detected signals appear in real-time • Save captured signals with custom names • Play back or transmit saved recordings For best results, place the antenna close to the transmitter.
ru: Этот экран позволяет записывать RF-сигналы с помощью модулей CC1101. • Выберите вкладку модуля для настройки • Нажмите «Старт» для начала записи • Обнаруженные сигналы появляются в реальном времени • Сохраняйте записи с пользовательскими именами • Воспроизводите или передавайте сохранённые записи Для лучших результатов поместите антенну ближе к передатчику.

# frequencySearchStarted
source: Frequency search started for Module {number}
ru: Поиск частоты начат для модуля {number}

# failedToStartFrequencySearch
source: Failed to start frequency search: {error}
ru: Не удалось начать поиск частоты: {error}

# failedToStopFrequencySearch
source: Failed to stop frequency search: {error}
ru: Не удалось остановить поиск частоты: {error}

# standingOnShoulders
source: Standing on the shoulders of giants
ru: Стоя на плечах гигантов

source: GitHub Profile
ru: Профиль GitHub

source: Donate
ru: Пожертвовать

source: SDR MODE
ru: Режим SDR

# sdrModeActiveSubtitle
source: Active — SubGhz ops blocked
ru: Активен — операции SubGhz заблокированы

# sdrModeInactiveSubtitle
source: CC1101 spectrum & raw RX via USB
ru: Спектр CC1101 и приём через USB

# sdrConnectViaUsb
source: Connect via USB serial for SDR streaming.
ru: Подключитесь через USB serial для потоковой передачи SDR.

# connectedStatus
source: Connected
ru: Подключено

# disconnectedStatus
source: Disconnected
ru: Отключено

source: Test Commands:
ru: Тестовые команды:

# deviceLabel
source: Device: {name}
ru: Устройство: {name}

# stateIdle
source: Idle
ru: Ожидание

# stateDetecting
source: Detecting
ru: Обнаружение

# stateRecording
source: Recording
ru: Запись

# stateTransmitting
source: Transmitting
ru: Передача

# stateUnknown
source: Unknown
ru: Неизвестно

source: NRF24: Jamming
ru: NRF24: Глушение

source: NRF24: Scanning
ru: NRF24: Сканирование

source: NRF24: Attacking
ru: NRF24: Атака

# nrf24SpectrumActive
source: NRF24: Spectrum
ru: NRF24: Спектр

source: NRF24: Idle
ru: NRF24: Ожидание

# batteryTooltip
source: Battery: {percentage}% ({volts} V){charging}
ru: Батарея: {percentage}% ({volts} В){charging}

source: ★ Special Thanks ★
ru: ★ Благодарности ★

# frequencyLabel
source: Frequency
ru: Частота

# modulationLabel
source: Modulation
ru: Модуляция

# dataRateLabel
source: Data Rate
ru: Скорость данных

# deviationLabel
source: Deviation
ru: Девиация

# dataLengthLabel
source: Data Length
ru: Длина данных

# flipperSubGhzDetails
source: • Raw signal data format • Used by Flipper Zero device • Contains frequency and modulation settings
ru: • Формат необработанных сигналов • Используется Flipper Zero • Содержит частоту и параметры модуляции

# tutJsonDetails
source: • JSON format with signal parameters • Used by TUT (Test & Utility Tool) • Contains frequency, data rate, and raw data
ru: • Формат JSON с параметрами сигнала • Используется TUT (Test & Utility Tool) • Содержит частоту, скорость и необработанные данные

source: SD Card: {path}
ru: SD-карта: {path}

source: RF Scanner
ru: RF сканер

# moreSamples
source: +{count} more
ru: +{count} ещё

# sampleCount
source: {count} samples
ru: {count} сэмплов

# transmitHistorySubtitle
source: {time} • Module {moduleNumber} • {repeatCount} repeats
ru: {time} • Модуль {moduleNumber} • {repeatCount} повторов

# downloadingFile
source: Downloading file: {name}
ru: Загрузка файла: {name}

# moduleStatus
source: Module {number}: {mode}
ru: Модуль {number}: {mode}

# transmittingEllipsis
source: Transmitting...
ru: Передача...

# chargingIndicator
source: ⚡ Charging
ru: ⚡ Зарядка
